ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
        // Multi-Page Programming (256 bytes per page)
        printf("[DEBUG] Programming %u bytes in pages...\n", size);

        DWT->CTRL |= 1;
        cycles_start = DWT->CYCCNT;

        uint32_t bytes_written = 0;
        while (bytes_written < size) {
            uint32_t page_size = (size - bytes_written) > 256 ? 256 : (size - bytes_written);
            uint32_t page_addr = addr + bytes_written;

            XSPI_WriteEnable(&hxspi2);

            sCommand.Instruction = OCTAL_PAGE_PROG_CMD;
            sCommand.DataMode    = HAL_XSPI_DATA_8_LINES;
            sCommand.DataLength  = page_size;
            sCommand.Address     = page_addr;

            if (HAL_XSPI_Command(&hxspi2, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
                printf("[ERROR] Program command failed at 0x%04X!\n", page_addr);
                return;
            }

            if (HAL_XSPI_Transmit(&hxspi2, &test_tx[bytes_written], HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
                printf("[ERROR] Transmit failed at 0x%04X!\n", page_addr);
                return;
            }

            XSPI_AutoPollingMemReady(&hxspi2);

            bytes_written += page_size;
        }

        cycles_end = DWT->CYCCNT;
        cycles_elapsed = cycles_end - cycles_start;

        uint32_t kbps = (size * 600) / cycles_elapsed;

        printf("  %4u bytes: %6u cycles (%4u us) = %5u KB/s (%u pages)\n",
               size, cycles_elapsed, CYCLES_TO_US(cycles_elapsed), kbps,
               (size + 255) / 256);
    }

    printf("\n[DEBUG] Write tests complete\n");

    /* ==================== TEST 2: READ ==================== */
    printf("\nTEST 2: Read Performance\n");
    printf("------------------------\n");

    for (test_idx = 0; test_idx < 4; test_idx++) {
        printf("[DEBUG] Test %d starting...\n", test_idx);

        uint32_t size = test_sizes[test_idx];
        uint32_t addr = test_addresses[test_idx];

        printf("[DEBUG] Reading %u bytes from 0x%04X...\n", size, addr);

        sCommand.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
        sCommand.Instruction        = OCTAL_IO_DTR_READ_CMD;
        sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
        sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_16_BITS;
        sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
        sCommand.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
        sCommand.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
        sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
        sCommand.DataMode           = HAL_XSPI_DATA_8_LINES;
        sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
        sCommand.Address            = addr;
        sCommand.DataLength         = size;
        sCommand.DummyCycles        = DUMMY_CLOCK_CYCLES_READ_OCTAL;
        sCommand.DQSMode            = HAL_XSPI_DQS_ENABLE;
        sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;

        if (HAL_XSPI_Command(&hxspi2, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
            printf("[ERROR] Read command failed!\n");
            return;
        }

        cycles_start = DWT->CYCCNT;

        if (HAL_XSPI_Receive(&hxspi2, test_rx, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
            printf("[ERROR] Receive failed!\n");
            return;
        }

        cycles_end = DWT->CYCCNT;
        cycles_elapsed = cycles_end - cycles_start;

        uint32_t kbps = (size * 600) / cycles_elapsed;

        printf("  %4u bytes: %6u cycles (%4u us) = %5u KB/s\n",
               size, cycles_elapsed, CYCLES_TO_US(cycles_elapsed), kbps);
    }

    printf("\n[DEBUG] Read tests complete\n");

    /* ==================== TEST 3: VERIFY ==================== */
    printf("\nTEST 3: Data Integrity\n");
    printf("----------------------\n");

    uint32_t total_errors = 0;

    for (test_idx = 0; test_idx < 4; test_idx++) {
        uint32_t size = test_sizes[test_idx];
        uint32_t addr = test_addresses[test_idx];
        uint32_t errors = 0;

        printf("[DEBUG] Verifying %u bytes from 0x%04X...\n", size, addr);

        sCommand.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
        sCommand.Instruction        = OCTAL_IO_DTR_READ_CMD;
        sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
        sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_16_BITS;
        sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
        sCommand.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
        sCommand.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
        sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
        sCommand.DataMode           = HAL_XSPI_DATA_8_LINES;
        sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
        sCommand.Address            = addr;
        sCommand.DataLength         = size;
        sCommand.DummyCycles        = DUMMY_CLOCK_CYCLES_READ_OCTAL;
        sCommand.DQSMode            = HAL_XSPI_DQS_ENABLE;
        sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;

        HAL_XSPI_Command(&hxspi2, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
        HAL_XSPI_Receive(&hxspi2, test_rx, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);

        for (uint32_t i = 0; i < size; i++) {
            if (test_rx[i] != (uint8_t)(i & 0xFF)) {
                errors++;
                if (errors <= 3) {
                    printf("  [ERROR] Byte %u: expected 0x%02X, got 0x%02X\n",
                           i, (uint8_t)(i & 0xFF), test_rx[i]);
                }
            }
        }

        total_errors += errors;
        printf("  %4u bytes: %s\n", size, errors ? "FAIL" : "PASS");
    }

    printf("\n");

    if (total_errors == 0) {
        printf("  *** ALL TESTS PASSED ***\n");
    } else {
        printf("  *** TESTS FAILED: %u errors ***\n", total_errors);
    }

    printf("\n================================================\n");
}
static inline uint16_t gain_to_q15(float gain)
{
    if (gain < 0.0f) gain = 0.0f;
    if (gain > 1.9999f) gain = 1.9999f;
    return (uint16_t)(gain * 32768.0f + 0.5f);
}

void process_mve(const uint16_t *src, const uint16_t *gain, uint16_t *dst, int n, int16_t offset)
{
    int i = 0;
    const int step = 8;
    const uint8_t shift = 15;

