ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
    const uint32x4_t rnd = vdupq_n_u32(1u << (shift - 1));
    const int32x4_t off32 = vdupq_n_s32(offset);
    const int32x4_t zeroS = vdupq_n_s32(0);
    const int32x4_t negSh = vdupq_n_s32(-15);

    for (; i <= n - step; i += step)
    {
        uint16x8_t s16 = vld1q_u16(src + i);
        uint16x8_t g16 = vld1q_u16(gain + i);

        uint32x4_t lo32 = vmullbq_int_u16(s16, g16);
        uint32x4_t hi32 = vmulltq_int_u16(s16, g16);

        lo32 = vaddq_u32(lo32, rnd);
        hi32 = vaddq_u32(hi32, rnd);

        lo32 = vshlq_u32(lo32, negSh);
        hi32 = vshlq_u32(hi32, negSh);

        int32x4_t loS = vqaddq_s32(vreinterpretq_s32_u32(lo32), off32);
        int32x4_t hiS = vqaddq_s32(vreinterpretq_s32_u32(hi32), off32);

        loS = vmaxq_s32(loS, zeroS);
        hiS = vmaxq_s32(hiS, zeroS);

        uint32x4_t loU = vreinterpretq_u32_s32(loS);
        uint32x4_t hiU = vreinterpretq_u32_s32(hiS);

        uint16x8_t out = vdupq_n_u16(0);
        out = vqmovnbq_u32(out, loU);
        out = vqmovntq_u32(out, hiU);

        vst1q_u16(dst + i, out);
    }

    for (; i < n; ++i) {
        uint32_t prod = (uint32_t)src[i] * (uint32_t)gain[i];
        uint32_t rounded = prod + (1u << (shift - 1));
        uint32_t shifted = rounded >> shift;
        int32_t result = (int32_t)shifted + (int32_t)offset;

        if (result < 0) result = 0;
        if (result > 65535) result = 65535;

        dst[i] = (uint16_t)result;
    }
}

void planck_lut_mve(const uint16_t *src, uint16_t *dst, int n)
{
    int i = 0;
    for (; i <= n - 8; i += 8)
    {
        uint16x8_t idx = vld1q_u16(src + i);
        uint16x8_t val = vldrhq_gather_shifted_offset_u16(planck_table, idx);
        vst1q_u16(dst + i, val);
    }
    for (; i < n; ++i) dst[i] = planck_table[src[i]];
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */



void test_memory_mapped_detailed(void) {
    printf("\n");
    printf("╔════════════════════════════════════════╗\n");
    printf("║ Memory-Mapped Access Detailed Debug   ║\n");
    printf("╚════════════════════════════════════════╝\n");

    // [1] XSPI Handle Status
    printf("\n[1] XSPI2 HAL Handle Status:\n");
    printf("  Handle State: ");
    switch(hxspi2.State) {
        case HAL_XSPI_STATE_RESET:
            printf("RESET\n");
            break;
        case HAL_XSPI_STATE_READY:
            printf("READY\n");
            break;
        case HAL_XSPI_STATE_BUSY_CMD:
            printf("BUSY_CMD\n");
            break;
        case HAL_XSPI_STATE_BUSY_TX:
            printf("BUSY_TX\n");
            break;
        case HAL_XSPI_STATE_BUSY_RX:
            printf("BUSY_RX\n");
            break;
        case HAL_XSPI_STATE_BUSY_AUTO_POLLING:
            printf("BUSY_AUTO_POLLING\n");
            break;
        case HAL_XSPI_STATE_BUSY_MEM_MAPPED:
            printf("BUSY_MEM_MAPPED ✓\n");
            break;
        case HAL_XSPI_STATE_ABORT:
            printf("ABORT\n");
            break;
        case HAL_XSPI_STATE_ERROR:
            printf("ERROR ✗\n");
            break;
        default:
            printf("UNKNOWN (%d)\n", hxspi2.State);
            break;
    }

    printf("  Error Code: 0x%08lX", hxspi2.ErrorCode);
    if (hxspi2.ErrorCode == HAL_XSPI_ERROR_NONE) {
        printf(" (No Error)\n");
    } else {
        printf("\n");
        if (hxspi2.ErrorCode & HAL_XSPI_ERROR_TIMEOUT) {
            printf("    - TIMEOUT\n");
        }
        if (hxspi2.ErrorCode & HAL_XSPI_ERROR_TRANSFER) {
            printf("    - TRANSFER ERROR\n");
        }
        if (hxspi2.ErrorCode & HAL_XSPI_ERROR_DMA) {
            printf("    - DMA ERROR\n");
        }
    }

    // [2] Configuration Summary
    printf("\n[2] XSPI Configuration:\n");
    printf("  Memory Type: ");
    switch(hxspi2.Init.MemoryType) {
        case HAL_XSPI_MEMTYPE_MICRON:
            printf("Micron\n");
            break;
        case HAL_XSPI_MEMTYPE_MACRONIX:
            printf("Macronix ✓\n");
            break;
        case HAL_XSPI_MEMTYPE_APMEM:
            printf("AP Memory\n");
            break;
        default:
            printf("Unknown\n");
            break;
    }

    printf("  Memory Size: %lu\n", hxspi2.Init.MemorySize);
    printf("  Clock Prescaler: %lu (÷%lu)\n",
           hxspi2.Init.ClockPrescaler,
           hxspi2.Init.ClockPrescaler + 1);
    printf("  Chip Select High Time: %lu cycles\n",
           hxspi2.Init.ChipSelectHighTimeCycle);
    printf("  Free Running Clock: %s\n",
           hxspi2.Init.FreeRunningClock == HAL_XSPI_FREERUNCLK_ENABLE ? "YES" : "NO");

    // [3] Try Memory Access
    printf("\n[3] Attempting Memory Access:\n");
    printf("  Base Address: 0x90000000\n");

    SCB->SHCSR |= SCB_SHCSR_USGFAULTENA_Msk;

    volatile uint32_t *test_addr = (uint32_t*)0x90000000;
    volatile uint32_t dummy = 0;

    printf("  Reading first word... ");
    __disable_irq();
    dummy = *test_addr;
    __enable_irq();
    printf("0x%08lX\n", dummy);

    printf("  Reading first 16 bytes:\n    ");
    for (int i = 0; i < 4; i++) {
        printf("0x%08lX ", test_addr[i]);
    }
    printf("\n");

    // [4] Data Pattern Analysis
    printf("\n[4] Data Pattern Analysis (first 256 bytes):\n");

    uint8_t all_ff = 1, all_00 = 1;
    volatile uint8_t *byte_ptr = (uint8_t*)0x90000000;
    uint32_t unique_bytes = 0;
    uint8_t byte_count[256] = {0};

    for (int i = 0; i < 256; i++) {
        uint8_t val = byte_ptr[i];
        if (val != 0xFF) all_ff = 0;
        if (val != 0x00) all_00 = 0;

        if (byte_count[val] == 0) {
            unique_bytes++;
        }
        byte_count[val]++;
    }

    if (all_ff) {
        printf("  Status: All 0xFF (Flash empty/erased)\n");
    } else if (all_00) {
        printf("  Status: All 0x00 (Likely read error)\n");
    } else {
        printf("  Status: Contains data pattern\n");
        printf("  Unique bytes: %lu / 256\n", unique_bytes);

        printf("  First values: ");
        int shown = 0;
        for (int i = 0; i < 32 && shown < 8; i++) {
            if (byte_ptr[i] != 0x00 && byte_ptr[i] != 0xFF) {
                printf("0x%02X ", byte_ptr[i]);
                shown++;
            }
        }
        printf("\n");
    }

    // [5] MPU Status
    printf("\n[5] MPU Status:\n");
    if (MPU->CTRL & MPU_CTRL_ENABLE_Msk) {
        printf("  MPU is ENABLED\n");
        printf("  Checking regions:\n");
        for (int region = 0; region < 8; region++) {
            MPU->RNR = region;
            uint32_t rbar = MPU->RBAR;
            uint32_t rlar = MPU->RLAR;

            if (rlar & MPU_RLAR_EN_Msk) {
                uint32_t base = rbar & 0xFFFFFFE0;
                printf("    Region %d: Base=0x%08lX ", region, base);
                if (base == 0x90000000) {
                    printf("✓ (Covers XSPI)\n");
                } else {
                    printf("\n");
                }
            }
        }
    } else {
        printf("  MPU is DISABLED\n");
    }

    // [6] Cache Status
    printf("\n[6] Cache Status:\n");
    if (SCB->CCR & SCB_CCR_IC_Msk) {
        printf("  I-Cache: ENABLED\n");
    } else {
        printf("  I-Cache: DISABLED\n");
    }
    if (SCB->CCR & SCB_CCR_DC_Msk) {
        printf("  D-Cache: ENABLED\n");
    } else {
        printf("  D-Cache: DISABLED\n");
    }

    printf("\n");
    printf("╔════════════════════════════════════════╗\n");
    printf("║ Debug Analysis Complete                ║\n");
    printf("╚════════════════════════════════════════╝\n");
}

void check_xspi_clock(void) {
    printf("\n=== XSPI Clock Configuration ===\n");

    uint32_t xspi_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_XSPI2);
    uint32_t xspi_clk_mhz = xspi_clk / 1000000;
    uint32_t xspi_clk_khz = (xspi_clk / 1000) % 1000;

    printf("  XSPI2 Kernel Clock: %lu Hz (%lu.%03lu MHz)\n",
           xspi_clk, xspi_clk_mhz, xspi_clk_khz);

    if (xspi_clk < 190000000 || xspi_clk > 210000000) {
        printf("  WARNING: Clock not optimal for OPI DTR!\n");
        printf("    Current: %lu MHz\n", xspi_clk_mhz);
        printf("    Recommended: 200 MHz\n");
    } else {
        printf("  ✓ Clock in optimal range (190-210 MHz)\n");
    }

    uint32_t prescaler = hxspi2.Init.ClockPrescaler;
    printf("  Prescaler: %lu (Divider: %lu)\n", prescaler, prescaler + 1);

    uint32_t flash_clk = xspi_clk / (prescaler + 1);
    uint32_t flash_clk_mhz = flash_clk / 1000000;
    uint32_t flash_clk_khz = (flash_clk / 1000) % 1000;

    printf("  Effective Flash Clock: %lu.%03lu MHz\n",
           flash_clk_mhz, flash_clk_khz);

