ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
    uint32_t theoretical_bandwidth = (flash_clk_mhz * 16);
    printf("  Theoretical Bandwidth: %lu MB/s (OPI DTR)\n", theoretical_bandwidth);
    printf("  (Practical: ~50%% = %lu MB/s due to overhead)\n", theoretical_bandwidth / 2);
}

void xspi_quick_status(void) {
    printf("\n=== XSPI2 Quick Status ===\n");

    printf("HAL State: ");
    if (hxspi2.State == HAL_XSPI_STATE_BUSY_MEM_MAPPED) {
        printf("Memory-Mapped Mode Active ✓\n");
    } else {
        printf("NOT in Memory-Mapped Mode ✗ (State=%d)\n", hxspi2.State);
    }

    if (hxspi2.ErrorCode != HAL_XSPI_ERROR_NONE) {
        printf("ERROR: 0x%08lX\n", hxspi2.ErrorCode);
    }

    printf("\nMemory Test: ");
    volatile uint32_t *test = (uint32_t*)0x90000000;
    uint32_t val = *test;
    printf("0x%08lX", val);

    if (val == 0xFFFFFFFF) {
        printf(" (Empty Flash)\n");
    } else if (val == 0x00000000) {
        printf(" (Read Error?)\n");
    } else {
        printf(" (Has Data) ✓\n");
    }

    uint32_t clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_XSPI2);
    printf("\nClock: %lu MHz\n", clk / 1000000);
}

void xspi_print_all_registers(void) {
    printf("\n╔════════════════════════════════════════╗\n");
    printf("║ XSPI2 Register Dump                    ║\n");
    printf("╚════════════════════════════════════════╝\n");

    XSPI_TypeDef *xspi = hxspi2.Instance;

    if (xspi == NULL) {
        printf("ERROR: XSPI2 instance is NULL!\n");
        return;
    }

    printf("\nControl Registers:\n");
    printf("  CR   = 0x%08lX\n", xspi->CR);
    printf("  DCR1 = 0x%08lX\n", xspi->DCR1);
    printf("  DCR2 = 0x%08lX\n", xspi->DCR2);
    printf("  DCR3 = 0x%08lX\n", xspi->DCR3);

    printf("\nStatus:\n");
    printf("  SR   = 0x%08lX\n", xspi->SR);
    printf("  Flags: ");
    if (xspi->SR & XSPI_SR_BUSY) printf("[BUSY] ");
    if (xspi->SR & XSPI_SR_TOF)  printf("[TIMEOUT] ");
    if (xspi->SR & XSPI_SR_TEF)  printf("[ERROR] ");
    if (xspi->SR & XSPI_SR_TCF)  printf("[COMPLETE] ");
    if (xspi->SR == 0) printf("(idle)");
    printf("\n");

    printf("\nCommand Configuration:\n");
    printf("  CCR  = 0x%08lX\n", xspi->CCR);
    printf("  TCR  = 0x%08lX\n", xspi->TCR);
    printf("  IR   = 0x%08lX\n", xspi->IR);

    printf("\nDecoded Configuration:\n");
    uint32_t devsize = (xspi->DCR1 & XSPI_DCR1_DEVSIZE) >> XSPI_DCR1_DEVSIZE_Pos;
    uint32_t mem_size_mb = (1UL << (devsize + 1)) / (1024 * 1024);
    printf("  Device Size: 2^%lu = %lu MB\n", devsize + 1, mem_size_mb);

    uint32_t prescaler = (xspi->DCR2 & XSPI_DCR2_PRESCALER) >> XSPI_DCR2_PRESCALER_Pos;
    printf("  Prescaler: %lu (Divider: %lu)\n", prescaler, prescaler + 1);

    uint32_t mtyp = (xspi->DCR1 & XSPI_DCR1_MTYP) >> XSPI_DCR1_MTYP_Pos;
    printf("  Memory Type: ");
    switch(mtyp) {
        case 0: printf("Micron\n"); break;
        case 1: printf("Macronix\n"); break;
        case 2: printf("Standard\n"); break;
        case 3: printf("AP Memory\n"); break;
        default: printf("Unknown\n"); break;
    }
}




int main(void)
{
    XSPI_RegularCmdTypeDef sCommand = {0};

    /* Enable Caches */
    SCB_EnableICache();
    SCB_EnableDCache();

    /* MCU Init */
    HAL_Init();
    SystemClock_Config();

    /* Peripherals Init */
    MX_GPIO_Init();
    MX_USART1_UART_Init();
    MX_XSPI2_Init();

    printf("XSPI Debug startet...\r\n");

    /* Initialize buffers */
    for (int i = 0; i < BUFFERSIZE; i++) {
        aTxBuffer[i] = i;
        aRxBuffer[i] = 0;
    }

    /* Switch to OPI DTR Mode */
    XSPI_NOR_OctalDTRModeCfg(&hxspi2);

    /* Basic Write/Read Test (your existing code) */
    XSPI_WriteEnable(&hxspi2);

    // ... (dein Erase/Write/Read Test bleibt) ...

    /* Performance Test */
    XSPI_PerformanceTest();

    /* =================================================== */
        /* Memory-Mapped Mode Activation                       */
        /* =================================================== */
        printf("\n╔════════════════════════════════════════════════╗\n");
        printf("║ XSPI Memory-Mapped Mode Initialization        ║\n");
        printf("╚════════════════════════════════════════════════╝\n");

        sCommand.OperationType      = HAL_XSPI_OPTYPE_READ_CFG;
        sCommand.Instruction        = OCTAL_IO_DTR_READ_CMD;
        sCommand.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
        sCommand.InstructionWidth   = HAL_XSPI_INSTRUCTION_16_BITS;
        sCommand.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
        sCommand.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
        sCommand.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
        sCommand.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
        sCommand.DataMode           = HAL_XSPI_DATA_8_LINES;
        sCommand.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
        sCommand.DummyCycles        = DUMMY_CLOCK_CYCLES_READ_OCTAL;
        sCommand.DQSMode            = HAL_XSPI_DQS_ENABLE;
        sCommand.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;

        if (HAL_XSPI_Command(&hxspi2, &sCommand, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
            printf("✗ XSPI Command failed!\n");
            Error_Handler();
        }

        printf("✓ Memory-Mapped Read Command configured\n");

        /* =================================================== */
        /* CRITICAL: Configure MPU BEFORE accessing memory!   */
        /* =================================================== */
        printf("\n=== Configuring MPU (BEFORE Memory Access) ===\n");

        ARM_MPU_Region_t mpu_table[] = {
            {
                .RBAR = ARM_MPU_RBAR(0x90000000UL, ARM_MPU_SH_NON, 0, 1, 0),
                .RLAR = ARM_MPU_RLAR(0x90000000UL + (512UL * 1024UL * 1024UL) - 1UL, 0)
            }
        };

        ARM_MPU_Disable();
        ARM_MPU_SetMemAttr(0, ARM_MPU_ATTR(
            ARM_MPU_ATTR_MEMORY_(1,0,1,0),
            ARM_MPU_ATTR_MEMORY_(1,0,1,0)
        ));
        ARM_MPU_Load(0, mpu_table, 1);
        ARM_MPU_Enable(MPU_CTRL_PRIVDEFENA_Msk);

